In [1]:
import pandas as pd

In [5]:
my_series = pd.Series([1, 6, -2, 3, -2, 0])

In [6]:
my_series

0    1
1    6
2   -2
3    3
4   -2
5    0
dtype: int64

In [7]:
my_series[1]

6

In [8]:
my_series[:2]

0    1
1    6
dtype: int64

In [9]:
my_series[my_series > 0]

0    1
1    6
3    3
dtype: int64

In [10]:
my_series * 2

0     2
1    12
2    -4
3     6
4    -4
5     0
dtype: int64

In [11]:
import numpy as np

In [12]:
np.exp(my_series)

0      2.718282
1    403.428793
2      0.135335
3     20.085537
4      0.135335
5      1.000000
dtype: float64

In [13]:
np.sum(my_series)

6

In [15]:
df = pd.DataFrame({
    'name': ['Masha', "Vasya", "Eduard"],
    'age' : [25, 8, 48],
    'job' : ["Coder", "student", "Big Boss"],
    'salary': [100, 10, 200]
})

In [16]:
df

     name  age       job  salary
0   Masha   25     Coder     100
1   Vasya    8   student      10
2  Eduard   48  Big Boss     200

In [17]:
name = df['name']

In [18]:
name

0     Masha
1     Vasya
2    Eduard
Name: name, dtype: object

In [20]:
df[df['salary'] >= 100]

     name  age       job  salary
0   Masha   25     Coder     100
2  Eduard   48  Big Boss     200

In [21]:
df['salary'] *= 10

In [22]:
df

     name  age       job  salary
0   Masha   25     Coder    1000
1   Vasya    8   student     100
2  Eduard   48  Big Boss    2000

In [25]:
df['salary'] /= 2

In [26]:
df

     name  age       job  salary
0   Masha   25     Coder   500.0
1   Vasya    8   student    50.0
2  Eduard   48  Big Boss  1000.0

In [27]:
df.T

            0        1         2
name    Masha    Vasya    Eduard
age        25        8        48
job     Coder  student  Big Boss
salary    500       50      1000